#--------------------------------------------------------------------
# ML 진행 관련 공통 기능 함수들
#--------------------------------------------------------------------
# 모듈 로딩 
import tensorflow as tf

#--------------------------------------------------------------------

# 함수 기능 : 텐서 저장 및 실행 기기 설멍 
# 함수 이름 : getDeviceName
# 매개 변수 : 없음
# 반  환 값 : 기기 이름
#--------------------------------------------------------------------


def getDeviceName():
    GPU_CNT = len( tf.config.list_physical_devices('GPU'))

    return '/device:GPU:0' if GPU_CNT else '/device:CPU:0'
